CRE_1.xml

<soap:Envelope
    xmlns:soap="http://schemas.xmlsoap.org/soap/envelope/">
    <soap:Header>
        <Header
            xmlns="http://xmlns.vodafone.co.uk/map/til/wsdl/Common/Header"
            xmlns:ns2="http://xmlns.vodafone.co.uk/map/til/Common/CommonObjects/Logon">
            <source>mig_myVodafone</source>
            <sourceTimestamp>2017-03-09T11:15:00.808Z</sourceTimestamp>
            <transactionId>32b37566-c5eb-4bd3-b22c-2889438fbe6a-1[S]-1</transactionId>
            <application>mig_vodafonePortal</application>
            <originator>mig</originator>
            <version>3.0</version>
        </Header>
    </soap:Header>
    <soap:Body>
        <ns4:CheckRetentionEligibilityRequest
            xmlns:ns4="http://xmlns.vodafone.co.uk/map/til/CustomerManagement/CustomerIncentivesManagement/IncentivesDefinition/CheckRetentionEligibility"
            xmlns="http://xmlns.oracle.com/EnterpriseObjects/Core/Custom/EBO/RetentionEBO/V1/"
            xmlns:ns10="http://xmlns.oracle.com/EnterpriseObjects/Core/EBO/InstalledProduct/V2"
            xmlns:ns11="http://xmlns.oracle.com/EnterpriseObjects/Core/Custom/EBO/InstalledProduct/V2"
            xmlns:ns12="http://xmlns.vodafone.co.uk/map/til/wsdl/Common/Header"
            xmlns:ns13="http://xmlns.vodafone.co.uk/map/til/Common/CommonObjects/Logon"
            xmlns:ns14="http://schemas.xmlsoap.org/ws/2003/03/addressing"
            xmlns:ns15="http://xmlns.oracle.com/EnterpriseObjects/Core/EBO/CustomerInteraction/V1"
            xmlns:ns16="http://xmlns.oracle.com/EnterpriseObjects/Core/Custom/EBO/CustomerInteraction/V1"
            xmlns:ns17="http://xmlns.vodafone.co.uk/map/til/Common/SimpleTypes"
            xmlns:ns2="http://xmlns.oracle.com/EnterpriseObjects/Core/Common/V2"
            xmlns:ns3="http://xmlns.oracle.com/EnterpriseObjects/Core/Custom/Common/V2"
            xmlns:ns5="http://xmlns.vodafone.co.uk/map/til/Common/ResultStatus"
            xmlns:ns6="urn:oasis:names:tc:xacml:2.0:policy:schema:cd:04"
            xmlns:ns7="urn:oasis:names:tc:xacml:2.0:context:schema:cd:04"
            xmlns:ns8="http://xmlns.oracle.com/EnterpriseObjects/Core/CommonEBO/V1"
            xmlns:ns9="http://xmlns.oracle.com/EnterpriseObjects/Core/Custom/CommonEBO/V1">
            <ns4:RetentionEligibility>
                <Identification>
                    <ns2:ApplicationObjectKey>
                        <ns2:ID>447901991089</ns2:ID>
                        <ns2:ContextID>MSISDN</ns2:ContextID>
                    </ns2:ApplicationObjectKey>
                </Identification>
            </ns4:RetentionEligibility>
        </ns4:CheckRetentionEligibilityRequest>
    </soap:Body>
</soap:Envelope>